DROP TABLE [ColorScheme];
CREATE TABLE [ColorScheme]
 (
  `ColorName`  nvarchar (510),
  `Comment`  nvarchar (510),
  `A1`  integer (1),
  `R1`  integer (1),
  `G1`  integer (1),
  `B1`  integer (1),
  `A2`  integer (1),
  `R2`  integer (1),
  `G2`  integer (1),
  `B2`  integer (1),
  `A3`  integer (1),
  `R3`  integer (1),
  `G3`  integer (1),
  `B3`  integer (1),
  `Cod`  integer (4),
  `ObjName`  nvarchar (510)
);

-- Inserting 42 rows into ColorScheme
INSERT INTO [ColorScheme] VALUES('SvtfYellow','Желтое показание светофора','255','255','255','0','255','255','255','0','255','255','255','0','37','Светофор');
INSERT INTO [ColorScheme] VALUES('SvtfLinesNormal','Линии и окантовка светофоров','255','0','0','0','255','0','0','0','255','0','0','0','38','Светофор');
INSERT INTO [ColorScheme] VALUES('Normal','Блок участки','255','0','0','0','255','0','0','0','255','0','0','0','1','РЦ');
INSERT INTO [ColorScheme] VALUES('Background','Фон','255','211','211','211','255','211','211','211','255','224','224','224','2','-');
INSERT INTO [ColorScheme] VALUES('Undefined','Неопределенное состояние','255','128','128','128','255','128','128','128','255','128','128','128','3','-');
INSERT INTO [ColorScheme] VALUES('Busy','Занятость','255','255','0','0','255','255','0','0','255','255','0','0','4','РЦ');
INSERT INTO [ColorScheme] VALUES('RouteSet','Устанавливаемый маршрут','255','255','255','0','255','255','255','192','255','255','255','192','5','РЦ');
INSERT INTO [ColorScheme] VALUES('RoutePzd','Поездной маршрут','255','0','255','0','255','0','192','0','255','0','192','0','6','РЦ');
INSERT INTO [ColorScheme] VALUES('RouteMnv','Маневровый маршрут','255','255','255','255','255','255','255','255','255','255','255','255','7','РЦ');
INSERT INTO [ColorScheme] VALUES('Zmk','Замыание не в маршруте','255','0','255','255','255','0','255','160','255','0','255','160','8','РЦ');
INSERT INTO [ColorScheme] VALUES('RoundOtu','Окантовка объектов ОТУ','255','255','255','0','255','255','255','0','255','255','255','0','9','-');
INSERT INTO [ColorScheme] VALUES('RoundBlock','Окантовка блокированных объектов','255','128','0','0','255','128','0','0','255','128','0','0','10','-');
INSERT INTO [ColorScheme] VALUES('RoundIzs','Окантовка искусственно замкнутых объектов','255','0','255','255','255','0','255','255','255','0','255','255','11','-');
INSERT INTO [ColorScheme] VALUES('Ir','Искусственная разделка','255','255','255','128','255','255','255','128','255','255','255','128','12','РЦ');
INSERT INTO [ColorScheme] VALUES('SvtfPzdClose','Закрытый поездной светофор','255','160','160','160','255','160','160','160','255','160','160','160','13','Светофор');
INSERT INTO [ColorScheme] VALUES('SvtfPzdOpen','Открытый поездной светофор','255','0','255','0','255','0','255','0','255','0','255','0','14','Светофор');
INSERT INTO [ColorScheme] VALUES('SvtfInClose','Закрытый входной светофор','255','160','160','160','255','255','64','64','255','255','64','64','15','Светофор');
INSERT INTO [ColorScheme] VALUES('SvtfMnvClose','Закрытый маневровый светофор','255','160','160','160','255','160','160','160','255','160','160','160','16','Светофор');
INSERT INTO [ColorScheme] VALUES('SvtfMnvOpen','Открытый маневровый светофор','255','255','255','255','255','255','255','255','255','255','255','255','17','Светофор');
INSERT INTO [ColorScheme] VALUES('SvtfPrglClose','Закрытый пригласительный светофор','255','160','160','160','255','160','160','160','255','160','160','160','18','Светофор');
INSERT INTO [ColorScheme] VALUES('SvtfPrglOpen','Открытый пригласительный светофор','255','255','255','255','255','255','255','255','255','255','255','255','19','Светофор');
INSERT INTO [ColorScheme] VALUES('TextStrl','Надписи стрелок','255','0','0','0','255','0','0','0','255','0','0','0','20','Стрелка');
INSERT INTO [ColorScheme] VALUES('TextSvtf','Надписи светофоров','255','0','0','0','255','0','0','0','255','0','0','0','21','Светофор');
INSERT INTO [ColorScheme] VALUES('TextStationName','Названия станций','255','0','0','0','255','0','0','0','255','0','0','0','22','Название');
INSERT INTO [ColorScheme] VALUES('Box','Отрисовка прямоугольников','255','128','128','128','255','128','128','128','255','128','128','128','23','-');
INSERT INTO [ColorScheme] VALUES('Selected','Выделение примитивов','255','255','255','255','255','255','255','255','255','255','255','255','24','-');
INSERT INTO [ColorScheme] VALUES('PrzdOpen','Открытый переезд','255','0','255','0','255','0','255','0','255','0','255','0','25','Переезд');
INSERT INTO [ColorScheme] VALUES('PrzdClose','Закрытый переезд','255','255','0','0','255','255','0','0','255','255','0','0','26','Переезд');
INSERT INTO [ColorScheme] VALUES('PrzdUnknown','Неизвестно состояние переезда','255','128','128','128','255','128','128','128','255','128','128','128','27','Переезд');
INSERT INTO [ColorScheme] VALUES('PrzdAlarmBack','Фон транспаранта аварии переезда','255','255','255','0','255','255','255','0','255','255','255','0','28','Переезд');
INSERT INTO [ColorScheme] VALUES('PrzdAlarmFore','Цвет текста транспаранта аварии переезда','255','255','0','0','255','255','0','0','255','255','0','0','29','Переезд');
INSERT INTO [ColorScheme] VALUES('Expired','Цвет при отсутствии контроля','64','128','128','128','64','128','128','128','64','128','128','128','30','-');
INSERT INTO [ColorScheme] VALUES('StrlNormal','Цвет стрелки нормальный','255','0','112','112','255','0','112','112','255','0','112','112','31','Стрелка');
INSERT INTO [ColorScheme] VALUES('StrlOtuRect','Окантовка при ОТУ','255','255','255','0','255','255','255','0','255','255','255','0','32','Стрелка');
INSERT INTO [ColorScheme] VALUES('StrlMuRect','Окантовка стрелки на МУ','255','255','255','255','255','255','255','255','255','255','255','255','33','Стрелка');
INSERT INTO [ColorScheme] VALUES('StrlIszRound','Окантовка при искусств.замыкании/блокировке','255','0','255','255','255','255','0','0','255','0','255','255','34','Стрелка');
INSERT INTO [ColorScheme] VALUES('StrlAlarmPulse1','Авария стрели, 1 фаза мигания','255','255','0','0','255','255','0','0','255','255','0','0','35','Стрелка');
INSERT INTO [ColorScheme] VALUES('StrlAlarmPulse2','Авария стрели, 2 фаза мигания','255','255','255','0','255','255','255','0','255','255','255','0','36','Стрелка');
INSERT INTO [ColorScheme] VALUES('SvtfAlarmCross','Авария светофора - перечеркивание','255','255','0','0','255','255','0','0','255','255','0','0','75','Светофор');
INSERT INTO [ColorScheme] VALUES('SvtfLockBackground','Фон надписи блокированного светофора','196','0','196','196','196','0','196','196','196','0','196','196','76','Светофор');
INSERT INTO [ColorScheme] VALUES('SvtfAdBackground','Фон надписи  светофора на автодействии','196','0','196','0','196','0','196','0','196','0','196','0','77','Светофор');
INSERT INTO [ColorScheme] VALUES('SvtfOmBackground','Фон  надписи светофора при отмене маршрута','255','255','255','0','255','255','255','0','255','255','255','0','78','Светофор');

DROP TABLE [TransparantsEx];
CREATE TABLE [TransparantsEx]
 (
  `No`  integer (2),
  `Text`  nvarchar (510),
  `Ts`  nvarchar (510),
  `W`  integer (2),
  `H`  integer (2),
  `File`  nvarchar (160),
  `On_ClrR`  integer (1),
  `On_ClrG`  integer (1),
  `On_ClrB`  integer (1),
  `On_BckR`  integer (1),
  `On_BckG`  integer (1),
  `On_BckB`  integer (1),
  `DrawWhenTsOff`  integer,
  `Off_ClrR`  integer (1),
  `Off_ClrG`  integer (1),
  `Off_ClrB`  integer (1),
  `Off_BckR`  integer (1),
  `Off_BckG`  integer (1),
  `Off_BckB`  integer (1),
  `EX_ClrR`  integer (1),
  `EX_ClrG`  integer (1),
  `EX_ClrB`  integer (1),
  `EX_BckR`  integer (1),
  `EX_BckG`  integer (1),
  `EX_BckB`  integer (1),
  `EX2RGB`  nvarchar (100),
  `Geometry`  nvarchar (510),
  `BitMapRed`  nvarchar (64),
  `BitMapGrn`  nvarchar (64),
  `BitMapYel`  nvarchar (64),
  `Pulse_DELETE`  integer,
  `Comment`  nvarchar (510)
);

-- Inserting 64 rows into TransparantsEx
INSERT INTO [TransparantsEx] VALUES('57','КТСМ2','КТСМ','48','24','57','0','0','0','220','220','220','0','159','159','159','220','220','220','','','','','','','','','BITMAP_KTCM_2','','','0','');
INSERT INTO [TransparantsEx] VALUES('58','GRNWHT','Индикатор','15','15','58','0','255','0','0','128','0','0','159','159','159','128','128','128','255','255','255','128','128','128','','','BITMAP_LAMP_GRN1','BITMAP_LAMP_GRN0','BITMAP_LAMP_WHT','0','');
INSERT INTO [TransparantsEx] VALUES('63','Здание','1','30','16','63','255','0','0','255','255','0','1','128','128','128','220','220','220','','','','','','','','M15,0 l-15,5 h30 z m-13,5 h26 v11 h-26  Z','BITMAP_BUILDING_RED_SMALL','BITMAP_BUILDING_SMALL','','0','');
INSERT INTO [TransparantsEx] VALUES('64','','1','32','28','64','0','0','0','200','200','200','0','159','159','159','220','220','220','','','','','','','','','BITMAP_BUTTON','','','0','');
INSERT INTO [TransparantsEx] VALUES('59','YELWHT','Индикатор','15','15','59','255','255','0','128','128','0','0','159','159','159','128','128','128','255','255','255','128','128','128','','','BITMAP_LAMP_YEL1','BITMAP_LAMP_YEL0','BITMAP_LAMP_WHT','0','');
INSERT INTO [TransparantsEx] VALUES('60','YELGRN','Индикатор','15','15','60','255','255','0','128','128','0','0','159','159','159','128','128','128','0','255','0','0','128','0','','','BITMAP_LAMP_YEL1','BITMAP_LAMP_YEL0','BITMAP_LAMP_GRN1','0','');
INSERT INTO [TransparantsEx] VALUES('61','<<','Выражение','15','15','61','128','0','0','255','0','0','0','0','128','0','0','255','0','128','128','128','255','255','255','','M0,7 l6,-7 v3  h9 v8 h-9 v3 Z','BITMAP_LFT_1','BITMAP_LFT_2','BITMAP_LFT_3','0','');
INSERT INTO [TransparantsEx] VALUES('62','>>','Выражение','15','15','62','128','0','0','255','0','0','0','0','128','0','0','255','0','128','128','128','255','255','255','','M15,7 l-6,-7 v3 h-9 v8 h9 v3 Z','BITMAP_RHT_1','BITMAP_RHT_2','BITMAP_RHT_3','0','');
INSERT INTO [TransparantsEx] VALUES('34','НКЗ','НКЗ','32','28','34','200','0','0','220','220','220','1','159','159','159','220','220','220','','','','','','','','','BITMAP_ODD_GRN','','','1','');
INSERT INTO [TransparantsEx] VALUES('37','СБФ','СБФ','36','24','37','255','0','0','255','255','0','1','159','159','159','220','220','220','','','','','','','','','BITMAP_SBF','','','0','');
INSERT INTO [TransparantsEx] VALUES('38','WHT','Индикатор','15','15','38','255','255','255','128','128','128','1','159','159','159','128','128','128','255','0','0','128','0','0','','','BITMAP_LAMP_WHT','BITMAP_LAMP_RED0','BITMAP_LAMP_RED1','0','');
INSERT INTO [TransparantsEx] VALUES('39','КПП','КПП','40','24','39','255','0','0','255','255','0','1','159','159','159','220','220','220','','','','','','','','','BITMAP_KPP','BITMAP_KPP0','','0','');
INSERT INTO [TransparantsEx] VALUES('40','ИР','ИР','32','24','40','255','0','0','255','255','0','0','159','159','159','220','220','220','','','','','','','','','BITMAP_IR1','BITMAP_IR2','','0','');
INSERT INTO [TransparantsEx] VALUES('41','ВЗ','ВЗ','32','24','41','255','0','0','255','255','0','0','159','159','159','220','220','220','','','','','','','','','BITMAP_VZ','BITMAP_VZ0','','0','');
INSERT INTO [TransparantsEx] VALUES('42','ЗС','ЗС','32','24','42','0','128','128','0','255','255','0','159','159','159','220','220','220','','','','','','','','','BITMAP_ZS','BITMAP_ZS0','','0','');
INSERT INTO [TransparantsEx] VALUES('43','Негаб','','13','13','43','128','128','128','255','255','128','0','128','128','128','255','255','128','','','','','','','','M0,6 a7,7 0 1 1 0,1 Z','BITMAP_NGBR','','','0','');
INSERT INTO [TransparantsEx] VALUES('44','СА','САК','32','24','44','255','0','0','255','255','0','0','159','159','159','220','220','220','','','','','','','','','BITMAP_SA','BITMAP_SA0','','0','');
INSERT INTO [TransparantsEx] VALUES('45','ЧДК','','48','24','45','0','128','0','0','255','0','0','159','159','159','220','220','220','','','','','','','','','BITMAP_CHDK_OFF','BITMAP_CHDK_ON','','0','');
INSERT INTO [TransparantsEx] VALUES('46','УПОРЧ','ЧУПУ','24','24','46','128','0','0','255','255','0','0','159','159','159','220','220','220','','','','','','','','M0,20 h24 v-12 z','BITMAP_KLIN_EVN','','','0','');
INSERT INTO [TransparantsEx] VALUES('47','УПОРН','НУПУ','24','24','47','0','0','0','220','220','220','0','159','159','159','220','220','220','','','','','','','','M24,20 h-24 v-12 z','BITMAP_KLIN_ODD','','','0','');
INSERT INTO [TransparantsEx] VALUES('48','RED','Индикатор','15','15','48','255','0','0','128','0','0','0','159','159','159','128','128','128','0','255','0','0','128','0','','','BITMAP_LAMP_RED1','BITMAP_LAMP_RED0','BITMAP_LAMP_GRN1','0','');
INSERT INTO [TransparantsEx] VALUES('49','GRN','Индикатор','15','15','49','0','255','0','0','128','0','0','159','159','159','128','128','128','255','0','0','128','0','0','','','BITMAP_LAMP_GRN1','BITMAP_LAMP_GRN0','BITMAP_LAMP_RED1','0','');
INSERT INTO [TransparantsEx] VALUES('50','YEL','Индикатор','15','15','50','255','255','0','128','128','0','0','159','159','159','128','128','128','255','0','0','128','0','0','','','BITMAP_LAMP_YEL1','BITMAP_LAMP_YEL0','BITMAP_LAMP_RED1','0','');
INSERT INTO [TransparantsEx] VALUES('1','А','АС','32','24','1','255','0','0','255','255','0','1','159','159','159','220','220','220','','','','','','','','','','','','0','');
INSERT INTO [TransparantsEx] VALUES('2','АПН','АПН','40','24','2','255','0','0','255','255','0','1','159','159','159','220','220','220','','','','','','','','','','','','0','');
INSERT INTO [TransparantsEx] VALUES('3','АПЧ','АПЧ','40','24','3','255','0','0','255','255','0','1','159','159','159','220','220','220','','','','','','','','','','','','0','');
INSERT INTO [TransparantsEx] VALUES('4','ТУ','АТУ','40','24','4','255','255','0','220','0','0','1','0','128','0','220','220','220','128','0','0','255','255','0','','','BITMAP_TU_RED','BITMAP_TU_GRN','BITMAP_TU_YEL','0','');
INSERT INTO [TransparantsEx] VALUES('5','АДН','АДН','48','24','5','0','128','0','0','255','0','1','159','159','159','220','220','220','','','','','','','','','BITMAP_ADN_GRN','BITMAP_ADN_RED','','0','');
INSERT INTO [TransparantsEx] VALUES('6','АДЧ','АДЧ','48','24','6','0','128','0','0','255','0','1','159','159','159','220','220','220','','','','','','','','','BITMAP_ADCH_GRN','BITMAP_ADCH_RED','','0','');
INSERT INTO [TransparantsEx] VALUES('7','День;Ночь','РСН','40','24','7','0','0','0','220','220','220','1','255','255','128','0','0','0','','','','','','','','','BITMAP_DAY','BITMAP_NIGHT','BITMAP_DAY0','0','');
INSERT INTO [TransparantsEx] VALUES('8','ДСН','ДСН','40','24','8','255','255','128','0','0','0','1','159','159','159','220','220','220','','','','','','','','','BITMAP_DSN','BITMAP_DSN0','','0','');
INSERT INTO [TransparantsEx] VALUES('9','АУМ','АУМ','48','24','9','0','200','0','255','255','0','1','159','159','159','220','220','220','','','','','','','','','BITMAP_AUM_ON','BITMAP_AUM_OFF','','0','');
INSERT INTO [TransparantsEx] VALUES('10','АД','АД','48','24','10','0','128','0','0','255','0','1','159','159','159','220','220','220','','','','','','','','','BITMAP_AD_ON','BITMAP_AD_OFF','','0','');
INSERT INTO [TransparantsEx] VALUES('11','ДУ;РУ;АУ;СУ','','40','24','11','0','159','0','220','220','220','1','159','0','0','220','220','220','0','0','0','220','220','220','0,128,128 255,255,255','','BITMAP_RU','BITMAP_DU','BITMAP_AU','0','');
INSERT INTO [TransparantsEx] VALUES('12','РОН','РОН','48','24','12','0','128','0','0','255','0','1','159','159','159','220','220','220','','','','','','','','','BITMAP_RON_GRN','BITMAP_RON_GRY','','0','');
INSERT INTO [TransparantsEx] VALUES('13','РОЧ','РОЧ','48','24','13','0','128','0','0','255','0','1','159','159','159','220','220','220','','','','','','','','','BITMAP_ROCH_GRN','BITMAP_ROCH_GRY','','0','');
INSERT INTO [TransparantsEx] VALUES('14','<<<<','Н','48','20','14','159','159','159','200','200','200','1','159','159','159','220','220','220','','','','','','','','','BITMAP_DIR_LFT','','','0','');
INSERT INTO [TransparantsEx] VALUES('15','>>>>','Ч','48','20','15','159','159','159','200','200','200','1','159','159','159','220','220','220','','','','','','','','','BITMAP_DIR_RHT','','','0','');
INSERT INTO [TransparantsEx] VALUES('16','<<','АУМН','15','24','16','0','128','0','255','255','0','1','159','159','159','220','220','220','','','','','','','','M 3,12 l 12,-12 v 24  Z','BITMAP_AUM_ODD_ON','BITMAP_AUM_ODD_OFF','','0','');
INSERT INTO [TransparantsEx] VALUES('17','>>','АУМЧ','15','24','17','0','128','0','255','255','0','1','159','159','159','220','220','220','','','','','','','','M 13,12 l -12,-12 v 24  Z','BITMAP_AUM_EVN_ON','BITMAP_AUM_EVN_OFF','','0','');
INSERT INTO [TransparantsEx] VALUES('18','ПОНАБ','ПОНАБ','64','24','18','255','0','0','255','255','0','1','159','159','159','220','220','220','','','','','','','','','','','','0','');
INSERT INTO [TransparantsEx] VALUES('19','Ф1','Ф1','32','24','19','255','0','0','255','255','0','1','0','128','0','220','220','220','','','','','','','','','BITMAP_F1_RED','BITMAP_F1_GRN','','0','');
INSERT INTO [TransparantsEx] VALUES('20','Ф2','Ф2','32','24','20','255','0','0','255','255','0','1','0','128','0','220','220','220','','','','','','','','','BITMAP_F2_RED','BITMAP_F2_GRN','','0','');
INSERT INTO [TransparantsEx] VALUES('21','Ф','Ф','32','24','21','255','0','0','255','255','0','1','0','128','0','220','220','220','','','','','','','','','','','','0','');
INSERT INTO [TransparantsEx] VALUES('22','ТС','','40','24','22','255','255','0','220','0','0','1','0','128','0','220','220','220','0','128','0','255','255','0','','','BITMAP_TS_RED','BITMAP_TS_GRN','BITMAP_TS_YEL','0','');
INSERT INTO [TransparantsEx] VALUES('23','УКСПС','УКСПС','60','24','23','255','255','0','255','0','0','1','159','159','159','220','220','220','','','','','','','','M 4 8 a 8 8  0 1 1 16  0 Z  m -4 0 h 24 v 6 h -24 Z','','','','0','');
INSERT INTO [TransparantsEx] VALUES('24','ОТ;РТ','ОТК','48','24','24','0','128','0','220','220','220','1','255','255','0','220','220','220','','','','','','','','','BITMAP_OTK_GRN','BITMAP_OTK_RED','','0','');
INSERT INTO [TransparantsEx] VALUES('25','САУТ','САУТ','48','24','25','255','255','0','255','0','0','1','159','159','159','220','220','220','','','','','','','','','','','','0','');
INSERT INTO [TransparantsEx] VALUES('26','РФ1','РФ1','40','24','26','0','128','0','220','220','220','1','128','128','128','220','220','220','','','','','','','','','','','','0','');
INSERT INTO [TransparantsEx] VALUES('27','РФ2','РФ2','40','24','27','0','128','0','220','220','220','1','128','128','128','220','220','220','','','','','','','','','','','','0','');
INSERT INTO [TransparantsEx] VALUES('28','Резерв;Основ','','40','24','28','0','128','0','255','255','255','1','0','128','0','220','220','220','','','','','','','','','BITMAP_RSRV_RED','BITMAP_RSRV_GRN','BITMAP_RSRV_YEL','0','');
INSERT INTO [TransparantsEx] VALUES('29','КП','','40','24','29','255','255','0','220','0','0','1','0','128','0','220','220','220','128','0','0','255','255','0','','','BITMAP_KP_RED','BITMAP_KP_GRN','BITMAP_KP_YEL','0','');
INSERT INTO [TransparantsEx] VALUES('30','ДИСК','ДИСКА','48','24','30','255','255','0','255','0','0','1','159','159','159','220','220','220','','','','','','','','','BITMAP_DISK_A','','','0','');
INSERT INTO [TransparantsEx] VALUES('31','ДИСК','ДИСКТ','40','24','31','255','0','0','255','255','0','1','159','159','159','220','220','220','','','','','','','','','BITMAP_DISK_T','','','0','');
INSERT INTO [TransparantsEx] VALUES('32','ЧКЗ','ЧКЗ','32','28','32','200','0','0','220','220','220','1','159','159','159','220','220','220','','','','','','','','','BITMAP_EVN_GRN','','','1','');
INSERT INTO [TransparantsEx] VALUES('33','ЧКЖ','ЧКЖ','32','28','33','128','0','0','255','0','0','1','159','159','159','220','220','220','','','','','','','','M 0,4 h9 v8 h25 v7 h-4 v5 h-4 v-5 h-4 v3 h-4 v-3 h-9 v 8 h-9  Z','BITMAP_EVN_YEL0','BITMAP_EVN_YEL','','0','');
INSERT INTO [TransparantsEx] VALUES('51','<<<','КНН','48','20','51','128','0','0','255','0','0','0','0','128','0','0','128','0','128','128','128','255','255','255','','M2,10 l8,-10 v5 h34 v10 h-34 v5 Z','BITMAP_DIR_LFT_PRG','BITMAP_DIR_LFT_PRG_FREE','BITMAP_DIR_LFT_PRG_CHNG','0','');
INSERT INTO [TransparantsEx] VALUES('52','>>>','КНЧ','48','20','52','128','0','0','255','0','0','0','0','128','0','0','128','0','128','128','128','255','255','255','','M44,10 l-8,-10 v5 h-34 v10 h34 v5 Z','BITMAP_DIR_RHT_PRG','BITMAP_DIR_RHT_PRG_FREE','BITMAP_DIR_RHT_PRG_CHNG','0','');
INSERT INTO [TransparantsEx] VALUES('53','Окно','ЧН','24','24','53','0','0','0','220','220','220','0','159','159','159','220','220','220','','','','','','','','','BITMAP_WORK','','','0','');
INSERT INTO [TransparantsEx] VALUES('54','Туннель','Н','24','48','54','0','0','0','220','220','220','0','159','159','159','220','220','220','','','','','','','','','BITMAP_TNL_O_RED','BITMAP_TNL_O_GRN','','0','');
INSERT INTO [TransparantsEx] VALUES('55','Туннель','Ч','24','48','55','0','0','0','220','220','220','0','159','159','159','220','220','220','','','','','','','','','BITMAP_TNL_E_RED','BITMAP_TNL_E_GRN','','0','');
INSERT INTO [TransparantsEx] VALUES('56','КТСМ1','КТСМ','48','24','56','0','0','0','220','220','220','0','159','159','159','220','220','220','','','','','','','','','BITMAP_KTCM_1','BITMAP_KTCM_0','','0','');
INSERT INTO [TransparantsEx] VALUES('36','Вокзал','1','60','32','36','255','0','0','255','255','0','1','128','128','128','220','220','220','','','','','','','','M13,0 l-13,12 h60 l-13,-12 Z M5,12 h50 v20 h-50 Z M14,16 h3 v10 h-3 Z m3,0 h3 v10 h-3 Z m10,0 h3 v10 h-3 Z m3,0 h3 v10 h-3 Z m10,0 h3 v10 h-3 Z m3,0 h3 v10 h-3 Z','BITMAP_BUILDING_RED','BITMAP_BUILDING','','0','');
INSERT INTO [TransparantsEx] VALUES('35','НКЖ','НКЖ','32','28','35','128','0','0','255','0','0','1','159','159','159','220','220','220','','','','','','','','M32,4 h-9 v8 h-25 v7 h4  v5 h4 v-5 h4 v3 h4 v-3 h9 v8 h9  Z','BITMAP_ODD_YEL0','BITMAP_ODD_YEL','','0','');

